
<?php
    include "header.php";
?>

	<?php
    if(isset($_SESSION['id']))
	{
		echo 'You are logged in as '.htmlspecialchars($_SESSION['username']);
		if(isset($_SESSION['priv'])) 
		{
			if ($_SESSION['priv']) include 'admin.php';

		}
		include 'buttons_logged_in.php';

    }
    else
	{
		include 'buttons_logged_out.php';
    }
	?>
	<p>Γεια σας!!!<br /><br />Είμαστε ο Αλέξανδρος και η Θωμαή!<br /><br />Το site μας ονομάζεται Heap Overflow (προς το παρόν!!).
	Πρόκειται για ένα site ερωτοαπαντήσεων. Κάθε εγγεγραμένο μέλος έχει τη δυνατότητα να ποστάρει κάποια ερώτηση (δημιουργία topic).
	Στη συνέχεια τα υπόλοιπα εγγεγραμένα μέλη μπορούν να απαντήσουν, αν θεωρούν ότι μπορούν να βοηθήσουν. Κάθε απάντηση αξιολογείται
	από τα υπόλοιπα μέλη παίρνοντας από το καθένα μία θετική ή αρνητική ψήφο. Οι ψήφοι αυτές συνθέτουν τη συνολική βαθμολογία της κάθε
	απάντησης. Στο τέλος, όταν κάποιος βλέπει ένα topic η σειρά με την οποία εμφανίζονται οι απαντήσεις είναι ανάλογα με τη βαθμολογία τους.<br /><br />
	Στο site υπάρχουν admins οι οποίοι έχουν δικαίωμα να επεξεργαστούν ερωτήσεις ή απαντήσεις, να διαγράψουν μέλη ή να τους δώσουν δικαιώματα 
	admin. Προς το παρόν admins είμαστε εμείς οι δύο. Σε περίπτωση που κάποια απάντηση θεωρηθεί άσχετη με την ερώτησή ή/και προσβλητική 
	θα διαγράφεται! Επίσης ΑΠΑΓΟΡΕΥΟΝΤΑΙ ΡΗΤΑ τα greeklish! Κάθε post που είναι γραμένο με greeklish διαγράφεται χωρίς ενημέρωση!<br /><br />
	Κάθε μέλος έχει δικαίωμα να επεξεργαστεί ή να διαγράψει μία απάντηση που έχει ποστάρει. Επίσης μπορεί να επεξεργαστεί κάποια ερώτηση που έχει θέσει.
	Δεν μπορεί, όμως, να διαγράψει ερώτηση, καθώς χωρίς αυτή δεν υφίσταται πια το topic. Αν κάποιο μέλος θέλει οπωσδήποτε να διαγράψει ερώτηση, 
	τότε θα πρέπει να το ζητήσει από έναν admin, έτσι ώστε αυτός να διαγράψει ολόκληρο το topic.<br /><br />Τα topics μπορούν να ανήκουν σε διάφορες 
	κατηγορίες. Αυτό διευκολύνει και στην αναζήτησή τους. Όταν κάποιος αναζητά κάποιο topic μπορεί να κάνει αναζήτηση ανάλογα με την κατηγορία κι 
	έτσι να του εμφανίζονται τα topics της εκάστοτε κατηγορίας.<br /><br />Τώρα, όσον αφορά τους μη εγγεγραμένους χρήστες, αυτοί έχουν τη δυνατότητα
	να διαβάσουν ερωτήσεις ή απαντήσεις, όμως δεν έχουν δικαίωμα να θέσουν ερώτηση, να απαντήσουν σε κάποιο topic ή ακόμα και να ψηφίσουν
	κάποια απάντηση.<br /><br />Αυτά προς το παρόν!!!!! Θα σας παρακαλέσουμε να χρησιμοποιήσετε το site με Google Chrome ή Internet Explorer! ΟΧΙ
	 με Mozilla Firefox!!! (Δεν τον συμπαθούμε!!!!)<br /><br />Μπορείτε να επικοινωνήσετε μαζί μας στις διευθύνσεις alejandro.rev@gmail.com και 
	 pitsa.rev@gmail.com (ναι, είμαστε τόσο ταιριαστοί :P :P ).
	</p>
<?php
    include "footer.php";
	?>	